# Eksploracja danych w Pandas

## Wczytanie danych Titanic

In [1]:
import pandas as pd

# Pobieranie danych bezpośrednio z internetu
# Opis danych https://www.kaggle.com/c/titanic/data
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url).set_index('PassengerId')

display(df)

C:\Users\jakub\AppData\Roaming\Python\Python310\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Brakujące wartości

In [2]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [14]:
#display(df.isna().any()) # Bool czy są puste
#display(df.isna().any(axis = 1)) # Czy puste wiersze
print(df.isna().sum()) # Sumowanie po kolumnach
print(df.isna().sum(axis=1)) # Sumowanie po wierszach

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64
PassengerId
1      1
2      0
3      1
4      0
5      1
      ..
887    1
888    0
889    2
890    0
891    1
Length: 891, dtype: int64

## Usuwanie brakujących wartości

In [35]:
df_dropna = df.dropna()  # Usunięcie wszystkich wierszy z brakującymi wartościami

## Usunięcie wszystkich wierszy z brakującymi wartościami w danych kolumnach
df_dropna = df.dropna(subset=['Age'])  
#
## Uzupełnienie medianą wieku
df_fillna = df.fillna({"Age": df["Age"].median()})  
#
## Usuwanie wierszy z dużą liczbą braków
#prog = 2 #len(df.columns) * 0.5  DO SPRAWDZENIA
#df_cleaned = df.dropna(thresh=prog, axis=1)
#display(df_cleaned)
#
## Wypełnianie na podstawie innej kolumny
median_age_by_class = df.groupby("Pclass")["Age"].transform(lambda x: x.fillna(x.median()))
df["Age"] = median_age_by_class

### Ćwiczenie: 
1. Wypełnij brakujące wartości w kolumnie "Embarked" najczęstszą wartością
2. Wypełnij brakujące wartości w kolumnie "Cabin" wartością "Unknown"
3. Sprawdź, ile wartości w kolumnie "Cabin" jest nadal nieznanych po wcześniejszym wypełnieniu
4. Wypełnij brakujące wartości w kolumnie "Age" średnią wieku dla danej płci "Sex"

In [77]:
naj = df['Embarked'].mode() # Najczęstsza Wartość
df.loc[df['Embarked'].isna(), 'Embarked'] = naj[0]
df['Cabin'] = df['Cabin'].fillna('Unknown')

print("Pustych wartości", df['Cabin'].isna().sum())

srednia_wieku_plec = df.groupby("Sex")["Age"].transform(lambda x: x.fillna(x.mean()))
df["Age"] = srednia_wieku_plec
print(df["Age"])

Pustych wartości 0
PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889    24.0
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

## Grupowanie i agregacja

In [81]:
# Funkcja value_counts()
display(df[['Survived', 'Sex']].value_counts())

# Funkcja groupby
# Grupowanie wg klasy i płci, średnia przeżywalność
agg_survival = df.groupby(["Pclass", "Sex"])['Survived'].mean()
display(agg_survival)
# Output jako DataFrame
agg_survival = df.groupby(["Pclass", "Sex"])[['Survived']].mean()
display(agg_survival)

Survived  Sex
0         male      468
1         female    233
          male      109
0         female     81
Name: count, dtype: int64

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

               Survived
Pclass Sex
1      female  0.968085
       male    0.368852
2      female  0.921053
       male    0.157407
3      female  0.500000
       male    0.135447

### Ćwiczenie: 
1. Policz medianę wieku dla każdej klasy pasażerów
2. Oblicz średnią cenę biletu dla każdej kombinacji "Pclass" i "Embarked"
3. Sprawdź maksymalną liczbę rodzeństwa i rodziców podróżujących razem dla każdej klasy

In [87]:
display(df.groupby(['Pclass'])[['Age']].median())
display(df.groupby(['Pclass', 'Embarked'])[['Fare']].mean())
df.groupby(['Pclass'])[['SibSp', 'Parch']].max()

         Age
Pclass
1       37.0
2       29.0
3       24.0

                       Fare
Pclass Embarked
1      C         104.718529
       Q          90.000000
       S          70.514244
2      C          25.358335
       Q          12.350000
       S          20.327439
3      C          11.214083
       Q          11.183393
       S          14.644083

        SibSp  Parch
Pclass
1           3      4
2           3      3
3           8      6

## Różne rodzaje agregacji

### Funkcje używane na `groupby` w Pandas

Po zastosowaniu `.groupby()` w Pandas można korzystać z różnych funkcji agregujących, transformujących i filtrujących dane.

#### **Funkcje agregujące (`.agg()`)**
Te funkcje zwracają jedną wartość dla każdej grupy:

- `.sum()` – suma wartości w grupie
- `.mean()` – średnia arytmetyczna
- `.median()` – mediana
- `.min()` – najmniejsza wartość
- `.max()` – największa wartość
- `.count()` – liczba elementów w grupie
- `.nunique()` – liczba unikalnych wartości w grupie
- `.first()` – pierwszy element w grupie
- `.last()` – ostatni element w grupie
- `.prod()` – iloczyn wartości
- `.std()` – odchylenie standardowe
- `.var()` – wariancja
- `.head(n)` - n pierwszych wartości
- `.tail(n)` - n ostatnich wartości

#### **Funkcje transformujące (`.transform()`)**
Te funkcje zwracają wartość dla każdego wiersza, zachowując oryginalny rozmiar:

- `.cumsum()` – skumulowana suma
- `.cumprod()` – skumulowany iloczyn
- `.rank()` – ranking wartości w grupie
- `.fillna()` – wypełnienie brakujących wartości
- `.ffill()` / `.bfill()` – propagacja wartości do przodu i do tyłu
- `.shift(n)` – przesunięcie wartości o `n` pozycji

In [111]:
# Grupowanie po klasie biletu
aggs = df.groupby(["Pclass", 'Embarked']).agg({
    "Age": ["mean", "median", "min", "max", "std"],
    "Fare": ["sum", "mean", "max", "min", "std"],
    "Survived": ["count", "sum", "mean"]
})
display(aggs)

# Grupowanie po płci
df_grouped = df.groupby(["Sex"]).agg({
    "Age": "mean",
    "Fare": "sum",
    "Survived": ["mean", "count"]
})
display(df_grouped)

                       Age                                      Fare  \
                      mean median    min   max        std        sum
Pclass Embarked
1      C         37.894118   37.0  16.00  71.0  13.282663  8901.0750
       Q         38.500000   38.5  33.00  44.0   7.778175   180.0000
       S         38.166047   37.0   0.92  80.0  14.167695  9096.3375
2      C         23.500000   27.0   1.00  36.0   9.756408   431.0917
       Q         38.666667   30.0  29.00  57.0  15.885003    37.0500
       S         30.319085   29.0   0.67  70.0  13.733401  3333.7000
3      C         21.976061   24.0   0.42  45.5   9.324932   740.1295
       Q         24.645833   24.0   2.00  70.5   9.610527   805.2043
       S         25.393768   24.0   1.00  74.0  10.992994  5169.3613

                                                          Survived      \
                       mean       max      min        std    count sum
Pclass Embarked
1      C         104.718529  512.3292  26.5500  99.093935       85  59
       Q          90.000000   90.0000  90.0000   0.000000        2   1
       S          70.514244  263.0000   0.0000  58.362242      129  76
2      C          25.358335   41.5792  12.0000  11.345067       17   9
       Q          12.350000   12.3500  12.3500   0.000000        3   2
       S          20.327439   73.5000   0.0000  13.630741      164  76
3      C          11.214083   22.3583   4.0125   4.871528       66  25
       Q          11.183393   29.1250   6.7500   6.721677       72  27
       S          14.644083   69.5500   0.0000  13.276609      353  67


                     mean
Pclass Embarked
1      C         0.694118
       Q         0.500000
       S         0.589147
2      C         0.529412
       Q         0.666667
       S         0.463415
3      C         0.378788
       Q         0.375000
       S         0.189802

              Age        Fare  Survived
             mean         sum      mean count
Sex
female  27.659236  13966.6628  0.742038   314
male    29.832184  14727.2865  0.188908   577

### Ćwiczenie: 
1. Oblicz odchylenie standardowe ceny biletu dla każdej klasy
2. Policz liczbę pasażerów dla każdej kombinacji "Pclass" i "Sex"

In [123]:
display(df.groupby(['Pclass'])[['Fare']].std())

display(df.groupby(['Pclass', 'Sex'])[['Survived']].count())

             Fare
Pclass
1       78.380373
2       13.417399
3       11.778142

               Survived
Pclass Sex
1      female        94
       male         122
2      female        76
       male         108
3      female       144
       male         347

## Sortowanie danych

In [128]:
# Sortowanie po wieku i cenie biletu
df_sorted = df.sort_values(by=["Age", "Fare"], ascending=[True, False])
display(df_sorted.head(10))

df_sorted_multi = df.sort_values(by=["Pclass", "Survived", "Age"], ascending=[True, False, True])
display(df_sorted_multi.head())

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,Unknown,C
756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,Unknown,S
470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,Unknown,C
645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,Unknown,C
79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,Unknown,S
832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,Unknown,S
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
387,0,3,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,46.9000,Unknown,S
165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,Unknown,S
184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S
436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S
690,1,1,"Madill, Miss. Georgette Alexandra",female,15.00,0,1,24160,211.3375,B5,S

### Ćwiczenie: 
Posortuj dane po płci i wieku rosnąco

In [130]:
df.sort_values(['Sex', 'Age'], ascending=True)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,Unknown,C
645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,Unknown,C
173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.00,1,1,347742,11.1333,Unknown,S
382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.00,0,2,2653,15.7417,Unknown,C
120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,Unknown,S
...,...,...,...,...,...,...,...,...,...,...,...
117,0,3,"Connors, Mr. Patrick",male,70.50,0,0,370369,7.7500,Unknown,Q
97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
494,0,1,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,Unknown,C
852,0,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,Unknown,S
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S